# 05. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

from math import sqrt

print('Программа находит растояние между двумя точками в 2D прострнстве')
xA = int(input("Введите координаты точки A\nX: "))
yA = int(input("Y: "))

xB = int(input("Введите координаты точки B\nX: "))
yB = int(input("Y: "))

print(f'Растояние между двумя точками равно {round(sqrt((xB - xA)**2 + (yB - yA)**2), 2)}')