# 03. Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
# отсчет начинается с правого верхнего угла и идет против часовой.
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

x = int(input('Программа выдает номер четверти плоскости координат по заданной точки.\nВведите X координату точки: '))
while (x == 0):
    x  = int(input('X не может быть равен 0 так как точка не будет находится в одной из плоскостей. Введите X повторно: '))
y = int(input('Введите Y координату точки: '))
while (y == 0):
    y  = int(input('Y не может быть равен 0 так как точка не будет находится в одной из плоскостей. Введите Y повторно: '))

if (x > 0) and (y > 0):
    print(f'Точка (X={x}; Y={y}) находится в первой четверти')
    
elif (x < 0) and (y > 0):
    print(f'Точка (X={x}; Y={y}) находится во второй четверти')
    
elif (x < 0) and (y < 0):
    print(f'Точка (X={x}; Y={y}) находится в третьей четверти')
    
else:
    print(f'Точка (X={x}; Y={y}) находится в четвертой четверти')