# Семинар 5
# Задача 021:
# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".
# Задача 022:
# Создайте программу для игры с конфетами человек против человека. Условие задачи: 
# На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга. 
# Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет. 
# Все конфеты оппонента достаются сделавшему последний ход. Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?
# •  a) Добавьте игру против бота
# •  b) Подумайте как наделить бота ""интеллектом""
# Задача 023:
# Создайте программу для игры в ""Крестики-нолики"".
# Задача 024:
# Реализуйте RLE алгоритм: реализуйте модуль сжатия и восстановления данных.
# ________________________________________
# Семинар 6
# Задача 025:
# Доделать реализацию функции eval со скобками
# Задача 026:
# Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.
# Пример:
# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]
# Задача 027:
# Найти сумму чисел списка стоящих на нечетной позиции
# Задача 028:
# Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1.
# Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}